{
  "selectedTemplate": 4,
  "headings": {
    "education": "",
    "skills": "",
    "projects": "",
    "awards": "",
    "work": "Experience"
  },
  "basics": {
    "name": "Saswata Dutta",
    "email": "saswat.dutta@gmail.com",
    "phone": "8178349520",
    "location": {
      "address": "Gurugram"
    },
    "website": "github.com/saswata-dutta"
  },
  "education": [
    {
      "location": "Guwahati",
      "endDate": "2013",
      "institution": "IIT Guwahati",
      "studyType": "M.Tech.",
      "area": "Computer Science and Engineering",
      "gpa": "8.92",
      "startDate": "2011"
    }
  ],
  "work": [
    {
      "highlights": [
        "Created platform for ingesting/querying relevant data in/out of our Data Lake. (Scala, Spark, Airflow, Python, Pandas, PySpark, AWS : Lambda, S3, Glue, Athena)",
        "Implemented “Vaayu”, a Spark based framework to process and store data from various sources.",
        "Implemented “Tejas”, a serverless feature store for sharing and reuse of features needed by ML models.",
        "Refactored “Payments/Commerce” services into separate micro-services corresponding to Payments (pay-in, pay-out), Wallet, Incentives, Fuel, and Fastag. (Java, Scala, Spring, Hibernate, MySql).",
        "Implemented realtime pay-out to suppliers via IMPS/NEFT from company accounts in ICICI, Yes bank and Axis Bank. Automated retries and refunds. Bank and payment mode selection based on the transaction details and recent success rate of the bank. Float maintenance within the company accounts.",
        "Wallet for demand and supply users which reflected the payments and incentives in realtime. This was linked with other services like bank accounts, Fuel vouchers and Fastag topups.",
        "Integration with all major vendors : IOCL, HPCL, Reliance, BPCL, to generate fuel vouchers.",
        "Rule based Incentive engine to distribute coupons to users in realtime. Rules for eligibility, and triggering of benefits were embedded in the coupon DSL which could be input by business analysts. ",
        "KYC service by performing penny drop on beneficiary account to verify name and account details.",
        "Implemented framework for integration and stress testing of entire payment/commerce ecosystem.",
        "Implemented queryable application log repository in Aws Glue/Athena, for ELK cost savings."
      ],
      "company": "Rivigo Services Pvt. Ltd.",
      "position": "Lead Engineer",
      "location": "Gurugram",
      "startDate": "Jun 2018",
      "endDate": "Present"
    },
    {
      "position": "Computer Scientist",
      "website": "",
      "endDate": "2018",
      "highlights": [
        "Feature development and performance optimisation in multiple releases of AEM Forms. (Scala, C++, Java, JavaScript, Python, Apache Sling/OSGI)",
        "Automatic Paper Form Capture:  Lead project from inception. Created pipelines for gathering datasets, defined protocol for communication between different knowledge sources, heuristically extract structure and semantics from “ﬂat documents”, created framework for measuring KPIs, implemented the merge and presentations engine which generated the final “Adaptive Form”.",
        "HTML5 and Adaptive forms:   Optimised browser footprint to allow large forms to be efficiently loaded.  Built a framework for auto importing xfa-pdf controls as html widgets. Worked on layout and formatting of elements in both html and pdf rendition. Worked on backend management, formatting and validation of user data, and generation of xml/json output for persistent storage."
      ],
      "company": "Adobe India Pvt. Ltd.",
      "location": "Noida/Bangaluru",
      "startDate": "2013"
    }
  ],
  "skills": [
    {
      "name": "",
      "level": "",
      "keywords": [
        null
      ]
    }
  ],
  "projects": [
    {
      "name": "Spark-Seed",
      "description": "Spark based framework to ingest data from any source, and flush to any sink. Aim of project is to allow easy configuration of simple ingestion and ETL with just “conf” files.",
      "url": "github.com/saswata-dutta/spark-seed",
      "keywords": [
        "Scala",
        "Apache Spark"
      ]
    },
    {
      "keywords": [
        "Python",
        "PySpark",
        "Pandas"
      ],
      "name": "aws-feature-store",
      "url": "github.com/saswata-dutta/aws-feature-store",
      "description": "A simple Feature-Store which allows schema evolution. Uses S3 for storage, Glue for data catalog, and Athena as SQL engine. Motivation was the lack of cost effective tooling for small to medium scale data processing."
    },
    {
      "keywords": [
        "Scala",
        "JavaScript"
      ],
      "description": "A generic expression parser and evaluator with support for variables and allowing extensions to operations. Input DSL can be json or lisp.",
      "name": "Eval-Expression",
      "url": "github.com/saswata-dutta/eval-exp"
    }
  ],
  "awards": [
    {
      "title": "",
      "date": "",
      "awarder": "",
      "summary": ""
    }
  ],
  "sections": [
    "templates",
    "profile",
    "work",
    "skills",
    "education",
    "projects",
    "awards"
  ]
}